In [14]:
import pandas as pn
import numpy as np

In [15]:
ar=pn.array([3,5,64,24])

In [16]:
ar

<PandasArray>
[3, 5, 64, 24]
Length: 4, dtype: int32

In [6]:
ar.ndim

1

In [7]:
ar=pn.array([2,3,6,1,2,7])
ar

<PandasArray>
[2, 3, 6, 1, 2, 7]
Length: 6, dtype: int32

In [8]:
s1=pn.Series([1,2,3,4])
s1

0    1
1    2
2    3
3    4
dtype: int64

In [9]:
type(s1)

pandas.core.series.Series

In [10]:
s1.index

RangeIndex(start=0, stop=4, step=1)

In [11]:
s1.index(['a','b','c'])
s1

TypeError: 'RangeIndex' object is not callable

In [18]:
studentNums=['16NM1A0'+str(i) for i in range(1,51)]
print(studentNums)
python=[np.random.randint(1,100) for i in range(1,51)]
print(python)
numpy=[np.random.randint(1,100) for i in range(1,51)]
print(numpy)
pandas=[np.random.randint(1,100) for i in range(1,51)]

['16NM1A01', '16NM1A02', '16NM1A03', '16NM1A04', '16NM1A05', '16NM1A06', '16NM1A07', '16NM1A08', '16NM1A09', '16NM1A010', '16NM1A011', '16NM1A012', '16NM1A013', '16NM1A014', '16NM1A015', '16NM1A016', '16NM1A017', '16NM1A018', '16NM1A019', '16NM1A020', '16NM1A021', '16NM1A022', '16NM1A023', '16NM1A024', '16NM1A025', '16NM1A026', '16NM1A027', '16NM1A028', '16NM1A029', '16NM1A030', '16NM1A031', '16NM1A032', '16NM1A033', '16NM1A034', '16NM1A035', '16NM1A036', '16NM1A037', '16NM1A038', '16NM1A039', '16NM1A040', '16NM1A041', '16NM1A042', '16NM1A043', '16NM1A044', '16NM1A045', '16NM1A046', '16NM1A047', '16NM1A048', '16NM1A049', '16NM1A050']
[66, 69, 86, 57, 20, 19, 43, 67, 43, 45, 26, 76, 18, 84, 72, 83, 16, 98, 98, 51, 52, 39, 33, 40, 53, 58, 76, 33, 36, 52, 94, 71, 41, 42, 61, 37, 46, 94, 69, 68, 33, 89, 17, 59, 32, 74, 56, 84, 77, 70]
[65, 63, 21, 85, 71, 71, 74, 73, 33, 60, 83, 49, 44, 48, 73, 25, 41, 33, 32, 34, 15, 91, 58, 65, 66, 11, 7, 10, 12, 30, 78, 72, 10, 90, 8, 75, 42, 81, 65, 7, 93, 46, 70, 80, 52, 31, 50, 95, 15, 94]

In [19]:
marks={'python':python,'pandas':pandas,'numpy':numpy}
marks_df=pn.DataFrame(marks,index=studentNums)
marks_df

           python  pandas  numpy
16NM1A01       66      66     65
16NM1A02       69      27     63
16NM1A03       86      64     21
16NM1A04       57      19     85
16NM1A05       20      83     71
16NM1A06       19      17     71
16NM1A07       43      97     74
16NM1A08       67      51     73
16NM1A09       43      27     33
16NM1A010      45      51     60
16NM1A011      26      44     83
16NM1A012      76      56     49
16NM1A013      18      22     44
16NM1A014      84      10     48
16NM1A015      72      52     73
16NM1A016      83      59     25
16NM1A017      16      18     41
16NM1A018      98      15     33
16NM1A019      98      50     32
16NM1A020      51      59     34
16NM1A021      52      75     15
16NM1A022      39      21     91
16NM1A023      33      43     58
16NM1A024      40      92     65
16NM1A025      53      21     66
16NM1A026      58       6     11
16NM1A027      76      88      7
16NM1A028      33       1     10
16NM1A029      36       6     12
16NM1A030      52      37     30
16NM1A031      94       9     78
16NM1A032      71      96     72
16NM1A033      41      85     10
16NM1A034      42      88     90
16NM1A035      61      36      8
16NM1A036      37      92     75
16NM1A037      46      94     42
16NM1A038      94      95     81
16NM1A039      69      86     65
16NM1A040      68      65      7
16NM1A041      33      63     93
16NM1A042      89      15     46
16NM1A043      17      24     70
16NM1A044      59      32     80
16NM1A045      32      71     52
16NM1A046      74      58     31
16NM1A047      56      56     50
16NM1A048      84      23     95
16NM1A049      77      62     15
16NM1A050      70      98     94

In [20]:
marks_df.head()

          python  pandas  numpy
16NM1A01      66      66     65
16NM1A02      69      27     63
16NM1A03      86      64     21
16NM1A04      57      19     85
16NM1A05      20      83     71

In [21]:
marks_df.tail(1)

           python  pandas  numpy
16NM1A050      70      98     94

In [22]:
marks_df['python'].head()

16NM1A01    66
16NM1A02    69
16NM1A03    86
16NM1A04    57
16NM1A05    20
Name: python, dtype: int64

In [23]:
marks_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 50 entries, 16NM1A01 to 16NM1A050
Data columns (total 3 columns):
python    50 non-null int64
pandas    50 non-null int64
numpy     50 non-null int64
dtypes: int64(3)
memory usage: 1.6+ KB

In [24]:
marks_df['pandas'].head()

16NM1A01    66
16NM1A02    27
16NM1A03    64
16NM1A04    19
16NM1A05    83
Name: pandas, dtype: int64

In [26]:
marks_df.shape

(50, 3)

In [27]:
marks_df.isnull().sum()

python    0
pandas    0
numpy     0
dtype: int64

In [28]:
marks_df.max()

python    98
pandas    98
numpy     95
dtype: int64

In [30]:
marks_df['python'].idxmax()

'16NM1A018'

In [31]:
marks_df['python'].mean()

56.46

In [32]:
marks_df['total marks']=marks_df['python']+marks_df['pandas']+marks_df['numpy']
marks_df['percentage']=(marks_df['total marks']*100/300)
marks_df.head()

          python  pandas  numpy  total marks  percentage
16NM1A01      66      66     65          197   65.666667
16NM1A02      69      27     63          159   53.000000
16NM1A03      86      64     21          171   57.000000
16NM1A04      57      19     85          161   53.666667
16NM1A05      20      83     71          174   58.000000

In [34]:
marks_df.iloc[0]

python          66.000000
pandas          66.000000
numpy           65.000000
total marks    197.000000
percentage      65.666667
Name: 16NM1A01, dtype: float64

In [36]:
marks_df['python']>40

16NM1A01      True
16NM1A02      True
16NM1A03      True
16NM1A04      True
16NM1A05     False
16NM1A06     False
16NM1A07      True
16NM1A08      True
16NM1A09      True
16NM1A010     True
16NM1A011    False
16NM1A012     True
16NM1A013    False
16NM1A014     True
16NM1A015     True
16NM1A016     True
16NM1A017    False
16NM1A018     True
16NM1A019     True
16NM1A020     True
16NM1A021     True
16NM1A022    False
16NM1A023    False
16NM1A024    False
16NM1A025     True
16NM1A026     True
16NM1A027     True
16NM1A028    False
16NM1A029    False
16NM1A030     True
16NM1A031     True
16NM1A032     True
16NM1A033     True
16NM1A034     True
16NM1A035     True
16NM1A036    False
16NM1A037     True
16NM1A038     True
16NM1A039     True
16NM1A040     True
16NM1A041    False
16NM1A042     True
16NM1A043    False
16NM1A044     True
16NM1A045    False
16NM1A046     True
16NM1A047     True
16NM1A048     True
16NM1A049     True
16NM1A050     True
Name: python, dtype: bool

In [37]:
marks_df.loc[['16NM1A06','16NM1A025']]

           python  pandas  numpy  total marks  percentage
16NM1A06       19      17     71          107   35.666667
16NM1A025      53      21     66          140   46.666667

In [38]:
len(marks_df['python'][marks_df['python']>=40])

37

In [42]:
marks_df[np.logical_and(np.logical_and((marks_df['python'] >= 40),
    (marks_df['pandas'] >= 40)),marks_df['numpy'] >= 40)].head()

           python  pandas  numpy  total marks  percentage
16NM1A01       66      66     65          197   65.666667
16NM1A07       43      97     74          214   71.333333
16NM1A08       67      51     73          191   63.666667
16NM1A010      45      51     60          156   52.000000
16NM1A012      76      56     49          181   60.333333

In [43]:
marks_df.to_csv('marks.csv')

In [44]:
marks_df.to_excel('marks.xlsx',sheet_name='Vignans students marks')

In [45]:
marks_df.to_numpy()

array([[ 66.        ,  66.        ,  65.        , 197.        ,
         65.66666667],
       [ 69.        ,  27.        ,  63.        , 159.        ,
         53.        ],
       [ 86.        ,  64.        ,  21.        , 171.        ,
         57.        ],
       [ 57.        ,  19.        ,  85.        , 161.        ,
         53.66666667],
       [ 20.        ,  83.        ,  71.        , 174.        ,
         58.        ],
       [ 19.        ,  17.        ,  71.        , 107.        ,
         35.66666667],
       [ 43.        ,  97.        ,  74.        , 214.        ,
         71.33333333],
       [ 67.        ,  51.        ,  73.        , 191.        ,
         63.66666667],
       [ 43.        ,  27.        ,  33.        , 103.        ,
         34.33333333],
       [ 45.        ,  51.        ,  60.        , 156.        ,
         52.        ],
       [ 26.        ,  44.        ,  83.        , 153.        ,
         51.        ],
       [ 76.        ,  56.        ,  49.        , 181.        ,
         60.33333333],
       [ 18.        ,  22.        ,  44.        ,  84.        ,
         28.        ],
       [ 84.        ,  10.        ,  48.        , 142.        ,
         47.33333333],
       [ 72.        ,  52.        ,  73.        , 197.        ,
         65.66666667],
       [ 83.        ,  59.        ,  25.        , 167.        ,
         55.66666667],
       [ 16.        ,  18.        ,  41.        ,  75.        ,
         25.        ],
       [ 98.        ,  15.        ,  33.        , 146.        ,
         48.66666667],
       [ 98.        ,  50.        ,  32.        , 180.        ,
         60.        ],
       [ 51.        ,  59.        ,  34.        , 144.        ,
         48.        ],
       [ 52.        ,  75.        ,  15.        , 142.        ,
         47.33333333],
       [ 39.        ,  21.        ,  91.        , 151.        ,
         50.33333333],
       [ 33.        ,  43.        ,  58.        , 134.        ,
         44.66666667],
       [ 40.        ,  92.        ,  65.        , 197.        ,
         65.66666667],
       [ 53.        ,  21.        ,  66.        , 140.        ,
         46.66666667],
       [ 58.        ,   6.        ,  11.        ,  75.        ,
         25.        ],
       [ 76.        ,  88.        ,   7.        , 171.        ,
         57.        ],
       [ 33.        ,   1.        ,  10.        ,  44.        ,
         14.66666667],
       [ 36.        ,   6.        ,  12.        ,  54.        ,
         18.        ],
       [ 52.        ,  37.        ,  30.        , 119.        ,
         39.66666667],
       [ 94.        ,   9.        ,  78.        , 181.        ,
         60.33333333],
       [ 71.        ,  96.        ,  72.        , 239.        ,
         79.66666667],
       [ 41.        ,  85.        ,  10.        , 136.        ,
         45.33333333],
       [ 42.        ,  88.        ,  90.        , 220.        ,
         73.33333333],
       [ 61.        ,  36.        ,   8.        , 105.        ,
         35.        ],
       [ 37.        ,  92.        ,  75.        , 204.        ,
         68.        ],
       [ 46.        ,  94.        ,  42.        , 182.        ,
         60.66666667],
       [ 94.        ,  95.        ,  81.        , 270.        ,
         90.        ],
       [ 69.        ,  86.        ,  65.        , 220.        ,
         73.33333333],
       [ 68.        ,  65.        ,   7.        , 140.        ,
         46.66666667],
       [ 33.        ,  63.        ,  93.        , 189.        ,
         63.        ],
       [ 89.        ,  15.        ,  46.        , 150.        ,
         50.        ],
       [ 17.        ,  24.        ,  70.        , 111.        ,
         37.        ],
       [ 59.        ,  32.        ,  80.        , 171.        ,
         57.        ],
       [ 32.        ,  71.        ,  52.        , 155.        ,
         51.66666667],
       [ 74.        ,  58.        ,  31.        , 163.        ,
         54.33333333],
       [ 56.        ,  56.        ,  50.        , 162.        ,
         54.        ],
       [ 84.        ,  23.        ,  95.        , 202.        ,
         67.33333333],
       [ 77.        ,  62.        ,  15.        , 154.        ,
         51.33333333],
       [ 70.        ,  98.        ,  94.        , 262.        ,
         87.33333333]])

In [46]:
titanic=pn.read_csv('titanic.csv')
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [47]:
titanic.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [49]:
titanic.info

<bound method DataFrame.info of      PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
5              6         0       3
6              7         0       1
7              8         0       3
8              9         1       3
9             10         1       2
10            11         1       3
11            12         1       1
12            13         0       3
13            14         0       3
14            15         0       3
15            16         1       2
16            17         0       3
17            18         1       2
18            19         0       3
19            20         1       3
20            21         0       2
21            22         1       2
22            23         1       3
23            24         1       1
24            25         0       3
25            26         1       3
26            27         0       3
27            28         0       1
28            29         1       3
29            30         0       3
..           ...       ...     ...
861          862         0       2
862          863         1       1
863          864         0       3
864          865         0       2
865          866         1       2
866          867         1       2
867          868         0       1
868          869         0       3
869          870         1       3
870          871         0       3
871          872         1       1
872          873         0       1
873          874         0       3
874          875         1       2
875          876         1       3
876          877         0       3
877          878         0       3
878          879         0       3
879          880         1       1
880          881         1       2
881          882         0       3
882          883         0       3
883          884         0       2
884          885         0       3
885          886         0       3
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
5                                     Moran, Mr. James    male   NaN      0
6                              McCarthy, Mr. Timothy J    male  54.0      0
7                       Palsson, Master. Gosta Leonard    male   2.0      3
8    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  female  27.0      0
9                  Nasser, Mrs. Nicholas (Adele Achem)  female  14.0      1
10                     Sandstrom, Miss. Marguerite Rut  female   4.0      1
11                            Bonnell, Miss. Elizabeth  female  58.0      0
12                      Saundercock, Mr. William Henry    male  20.0      0
13                         Andersson, Mr. Anders Johan    male  39.0      1
14                Vestrom, Miss. Hulda Amanda Adolfina  female  14.0      0
15                    Hewlett, Mrs. (Mary D Kingcome)   female  55.0      0
16                                Rice, Master. Eugene    male   2.0      4
17                        Williams, Mr. Charles Eugene    male   NaN      0
18   Vander Planke, Mrs. Julius (Emelia Maria Vande...  female  31.0      1
19                             Masselmani, Mrs. Fatima  female   NaN      0
20                                Fynney, Mr. Joseph J    male  35.0      0
21                               Beesley, Mr. Lawrence    male  34.0      0
22                         McGowan, Miss. Anna "Annie"  female  15.0      0
23                        Sloper, Mr. William Thompson    male  28.0      0
24                       Palsson, Miss. Torborg Danira  female   8.0      3
25   Asplund, Mrs. Carl Oscar (Selma Augusta Emilia...  female  38.0      1
26                             Emir, Mr. Farred Chehab    male   NaN      0
27                      Fortune, Mr. Charles Alexander    male  19.0      3
28                       O'Dwyer, Miss. Ellen "Nellie"  female   NaN      0
29                                 Todoroff, Mr. Lalio    male   NaN      0
..                                                 ...     ...   ...    ...
861                        Giles, Mr. Frederick Edward    male  21.0      1
862  Swift, Mrs. Frederick Joel (Margaret Welles Ba...  female  48.0      0
863                  Sage, Miss. Dorothy Edith "Dolly"  female   NaN      8
864                             Gill, Mr. John William    male  24.0      0
865                           Bystrom, Mrs. (Karolina)  female  42.0      0
866                       Duran y More, Miss. Asuncion  female  27.0      1
867               Roebling, Mr. Washington Augustus II    male  31.0      0
868                        van Melkebeke, Mr. Philemon    male   NaN      0
869                    Johnson, Master. Harold Theodor    male   4.0      1
870                                  Balkic, Mr. Cerin    male  26.0      0
871   Beckwith, Mrs. Richard Leonard (Sallie Monypeny)  female  47.0      1
872                           Carlsson, Mr. Frans Olof    male  33.0      0
873                        Vander Cruyssen, Mr. Victor    male  47.0      0
874              Abelson, Mrs. Samuel (Hannah Wizosky)  female  28.0      1
875                   Najib, Miss. Adele Kiamie "Jane"  female  15.0      0
876                      Gustafsson, Mr. Alfred Ossian    male  20.0      0
877                               Petroff, Mr. Nedelio    male  19.0      0
878                                 Laleff, Mr. Kristo    male   NaN      0
879      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)  female  56.0      0
880       Shelley, Mrs. William (Imanita Parrish Hall)  female  25.0      0
881                                 Markun, Mr. Johann    male  33.0      0
882                       Dahlberg, Miss. Gerda Ulrika  female  22.0      0
883                      Banfield, Mr. Frederick James    male  28.0      0
884                             Sutehall, Mr. Henry Jr    male  25.0      0
885               Rice, Mrs. William (Margaret Norton)  female  39.0      0
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket      Fare        Cabin Embarked
0        0         A/5 21171    7.2500          NaN        S
1        0          PC 17599   71.2833          C85        C
2        0  STON/O2. 3101282    7.9250          NaN        S
3        0            113803   53.1000         C123        S
4        0            373450    8.0500          NaN        S
5        0            330877    8.4583          NaN        Q
6        0             17463   51.8625          E46        S
7        1            349909   21.0750          NaN        S
8        2            347742   11.1333          NaN        S
9        0            237736   30.0708          NaN        C
10       1           PP 9549   16.7000           G6        S
11       0            113783   26.5500         C103        S
12       0         A/5. 2151    8.0500          NaN        S
13       5            347082   31.2750          NaN        S
14       0            350406    7.8542          NaN        S
15       0            248706   16.0000          NaN        S
16       1            382652   29.1250          NaN        Q
17       0            244373   13.0000          NaN        S
18       0            345763   18.0000          NaN        S
19       0              2649    7.2250          NaN        C
20       0            239865   26.0000          NaN        S
21       0            248698   13.0000          D56        S
22       0            330923    8.0292          NaN        Q
23       0            113788   35.5000           A6        S
24       1            349909   21.0750          NaN        S
25       5            347077   31.3875          NaN        S
26       0              2631    7.2250          NaN        C
27       2             19950  263.0000  C23 C25 C27        S
28       0            330959    7.8792          NaN        Q
29       0            349216    7.8958          NaN        S
..     ...               ...       ...          ...      ...
861      0             28134   11.5000          NaN        S
862      0             17466   25.9292          D17        S
863      2          CA. 2343   69.5500          NaN        S
864      0            233866   13.0000          NaN        S
865      0            236852   13.0000          NaN        S
866      0     SC/PARIS 2149   13.8583          NaN        C
867      0          PC 17590   50.4958          A24        S
868      0            345777    9.5000          NaN        S
869      1            347742   11.1333          NaN        S
870      0            349248    7.8958          NaN        S
871      1             11751   52.5542          D35        S
872      0               695    5.0000  B51 B53 B55        S
873      0            345765    9.0000          NaN        S
874      0         P/PP 3381   24.0000          NaN        C
875      0              2667    7.2250          NaN        C
876      0              7534    9.8458          NaN        S
877      0            349212    7.8958          NaN        S
878      0            349217    7.8958          NaN        S
879      1             11767   83.1583          C50        C
880      1            230433   26.0000          NaN        S
881      0            349257    7.8958          NaN        S
882      0              7552   10.5167          NaN        S
883      0  C.A./SOTON 34068   10.5000          NaN        S
884      0   SOTON/OQ 392076    7.0500          NaN        S
885      5            382652   29.1250          NaN        Q
886      0            211536   13.0000          NaN        S
887      0            112053   30.0000          B42        S
888      2        W./C. 6607   23.4500          NaN        S
889      0            111369   30.0000         C148        C
890      0            370376    7.7500          NaN        Q

[891 rows x 12 columns]>

In [50]:
titanic.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [51]:
titanic['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [52]:
titanic['Pclass'].value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [53]:
titanic['Survived'].value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [55]:
titanic['Cabin'].value_counts()

B96 B98        4
G6             4
C23 C25 C27    4
C22 C26        3
E101           3
F2             3
F33            3
D              3
D26            2
C126           2
C2             2
E44            2
F4             2
D20            2
B22            2
D17            2
C125           2
B51 B53 B55    2
B20            2
B58 B60        2
F G73          2
D35            2
E24            2
B28            2
B18            2
B5             2
B49            2
B77            2
C123           2
E25            2
              ..
A34            1
E34            1
B37            1
A7             1
D15            1
B102           1
E12            1
T              1
A32            1
B69            1
C104           1
C45            1
C70            1
B78            1
B39            1
B41            1
B3             1
B71            1
C85            1
C87            1
C49            1
B94            1
E77            1
A24            1
C90            1
A5             1
C99            1
B19            1
E49            1
E58            1
Name: Cabin, Length: 147, dtype: int64

In [58]:
titanic.drop('Cabin',axis=1,inplace=True)
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S

In [59]:
titanic['Age'].mean()

29.69911764705882

In [61]:
titanic['Age'].fillna(titanic['Age'].mean(),inplace=True)

In [62]:
titanic.tail(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
881,882,0,3,"Markun, Mr. Johann",male,33.000000,0,0,349257,7.8958,S
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.000000,0,0,7552,10.5167,S
883,884,0,2,"Banfield, Mr. Frederick James",male,28.000000,0,0,C.A./SOTON 34068,10.5000,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.000000,0,0,SOTON/OQ 392076,7.0500,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.000000,0,5,382652,29.1250,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.000000,0,0,211536,13.0000,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.000000,0,0,112053,30.0000,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,29.699118,1,2,W./C. 6607,23.4500,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.000000,0,0,111369,30.0000,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.000000,0,0,370376,7.7500,Q

In [63]:
titanic['Embarked'].fillna('S',inplace=True)

In [64]:
titanic.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64